STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L562E-DK/stm32l562e_discovery_idd.c
/**
  ******************************************************************************
  * @file    stm32l562e_discovery_idd.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage the
  *          Idd measurement driver for STM32L562E-DK board.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l562e_discovery.h"
#include "stm32l562e_discovery_idd.h"
/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32L562E-DK
  * @{
  */

/** @defgroup STM32L562E-DK_IDD STM32L562E-DK IDD
  * @brief This file includes the Idd driver for STM32L562E-DK board.
  *        It allows user to measure MCU Idd current on board, especially in
  *        different low power modes.
  * @{
  */

/** @defgroup STM32L562E-DK_IDD_Private_Defines STM32L562E-DK IDD Private Defines
  * @{
  */

/**
  * @brief  PowerShield HW constant.
  * Refer to UM2269 Table 1
  */
#define PS_TIMEOUT                     200UL
#define PS_CMD_LENGTH_MAX              20U
#define PS_SHELL_FEEDBACK_LENGTH_MAX   100U
#define PS_NOT_READY_RETRY_DELAY_MS    8000UL
#define PS_SHELL_BUFFER_EMPTY_DELAY_MS 30UL
#define PS_SHELL_CHAR_UNIT_MILLI       ((uint8_t)'m')
#define CHAR_END_OF_STRING             ((uint8_t)'\0')

#define PS1_INSTANCE                   LPUART1
#define PS1_CLK_ENABLE()               __HAL_RCC_LPUART1_CLK_ENABLE()
#define PS1_CLK_DISABLE()              __HAL_RCC_LPUART1_CLK_DISABLE()
#define PS1_TX_GPIO_PORT               GPIOB
#define PS1_TX_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOB_CLK_ENABLE()
#define PS1_TX_PIN                     GPIO_PIN_11
#define PS1_TX_AF                      GPIO_AF8_LPUART1
#define PS1_RX_GPIO_PORT               GPIOB
#define PS1_RX_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOB_CLK_ENABLE()
#define PS1_RX_PIN                     GPIO_PIN_10
#define PS1_RX_AF                      GPIO_AF8_LPUART1

#define PS1_IRQOUT_GPIO_CLK_ENABLE()   __HAL_RCC_GPIOC_CLK_ENABLE()
#define PS1_IRQOUT_GPIO_CLK_DISABLE()  __HAL_RCC_GPIOC_CLK_DISABLE()
#define PS1_IRQOUT_GPIO_PIN            GPIO_PIN_13
#define PS1_IRQOUT_GPIO_PORT           GPIOC
#define PS1_IRQOUT_EXTI_IRQn           EXTI13_IRQn
#define PS1_IRQOUT_EXTI_LINE           EXTI_LINE_13
/**
  * @}
  */

/** @defgroup STM32L562E-DK_IDD_Private_Constants STM32L562E-DK IDD Private Constants
  * @{
  */
/**
  * @brief  Command send to PowerShield.
  * Refer to UM2269 Table 1
  */
#define PS1_CMD_htc_string "htc"
#define PS1_CMD_output_energy_string "output energy"
#define PS1_CMD_freq_string "freq "
#define PS1_CMD_acqtime_string "acqtime "
#define PS1_CMD_trigdelay_string "trigdelay "
#define PS1_CMD_voltage_string "volt "
#define PS1_CMD_voltage_no_calibration_string " nocal"
#define PS1_CMD_start_string "start"
#define PS1_CMD_enableit_string "itend en"
#define PS1_CMD_disableit_string "itend dis"
#define PS1_CMD_getlast_string "getlast n"
#define PS1_CMD_psrst_string "psrst"
#define PS1_GET_ack_string "ack"
#define PS1_GET_end_string "end"
#define PS1_shell_command_end_characters_string "\r\n"
#define PS1_shell_prompt_string "PowerShield > "
#define PS1_shell_acknowledge_string "ack "
#define PS1_shell_error_string "error"
#define PS1_shell_error_description_string "Error detail:"


static uint8_t PS1_CMD_htc[] = PS1_CMD_htc_string;
//static uint8_t PS1_GET_ack[] = PS1_GET_ack_string;
//static uint8_t PS1_GET_end[] = PS1_GET_end_string;
static uint8_t PS1_shell_command_end_characters[] = PS1_shell_command_end_characters_string;
//static uint8_t PS1_shell_error[] = PS1_shell_error_string;
/**
  * @}
  */

/** @defgroup STM32L562E-DK_IDD_Exported_Variables STM32L562E-DK IDD Exported Variables
  * @{
  */
IDD_Ctx_t Idd_Ctx[IDD_INSTANCES_NBR] = {0};
/**
  * @}
  */

/** @defgroup STM32L562E-DK_IDD_Private_FunctionPrototypes STM32L562E-DK IDD Private Function Prototypes
  * @{
  */
static void IDD1_EXTI_Callback(void);
static uint32_t asciiToUint(uint8_t * buf);
static uint32_t uintToAscii(uint32_t uintNumber, uint8_t * buf);
static int32_t waitForAckData(uint8_t *cmd, uint32_t cmd_length, uint8_t *returned_data, uint32_t *returned_data_length);
static int32_t SendCmdData(uint8_t *cmd, uint32_t cmd_length, uint8_t *returned_data, uint32_t *returned_data_length);
static int32_t SendCmdNoData(uint8_t *cmd, uint32_t cmd_length);
/**
  * @}
  */

/** @defgroup STM32L562E-DK_IDD_Exported_Functions STM32L562E-DK IDD Exported Functions
  * @{
  */

/**
  * @brief  BSP Idd measurement ended Callback
  * @param  Instance IDD Instance.
  * @retval None.
  */
__weak void BSP_IDD_Callback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  /* This function should be implemented by the user application. */
}

/**
  * @brief  BSP IDD interrupt handler.
  * @param  Instance IDD instance.
  * @retval None.
  */
void BSP_IDD_IRQHandler(uint32_t Instance)
{
  HAL_EXTI_IRQHandler(&Idd_Ctx[Instance].hidd_exti);
}

/**
  * @brief  Initialize IDD measurement component
  * @param  Instance IDD instance.
  * @retval BSP status.
  */
int32_t BSP_IDD_Init(uint32_t Instance)
{
  uint8_t PS1_CMD_output_energy[] = PS1_CMD_output_energy_string;

  int32_t status = BSP_ERROR_NONE;

  if(Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state != IDD_IDLE)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    GPIO_InitTypeDef GPIO_Init;

    PS1_TX_GPIO_CLK_ENABLE();
    PS1_RX_GPIO_CLK_ENABLE();
    PS1_CLK_ENABLE();

    /* Configure COM Tx as alternate function */
    GPIO_Init.Pin       = PS1_TX_PIN;
    GPIO_Init.Mode      = GPIO_MODE_AF_OD;
    GPIO_Init.Speed     = GPIO_SPEED_FREQ_HIGH;
    GPIO_Init.Pull      = GPIO_PULLUP;
    GPIO_Init.Alternate = PS1_TX_AF;
    HAL_GPIO_Init(PS1_TX_GPIO_PORT, &GPIO_Init);

