STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L562E-DK/stm32l562e_discovery_idd.c
    /* Configure COM Rx as alternate function */
    GPIO_Init.Pin       = PS1_RX_PIN;
    GPIO_Init.Alternate = PS1_RX_AF;
    HAL_GPIO_Init(PS1_RX_GPIO_PORT, &GPIO_Init);

    /* COM configuration */
    Idd_Ctx[Instance].UartHandle.Instance        = PS1_INSTANCE;
    Idd_Ctx[Instance].UartHandle.Init.BaudRate   = 115200;
    Idd_Ctx[Instance].UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
    Idd_Ctx[Instance].UartHandle.Init.StopBits   = UART_STOPBITS_1;
    Idd_Ctx[Instance].UartHandle.Init.Parity     = UART_PARITY_NONE;
    Idd_Ctx[Instance].UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
    Idd_Ctx[Instance].UartHandle.Init.Mode       = UART_MODE_TX_RX;

    /* Configure default measure */
    Idd_Ctx[Instance].IddConfig.PreDelay = 1000;
    Idd_Ctx[Instance].IddConfig.AcquisitionDuration = 1000;
    Idd_Ctx[Instance].IddConfig.Voltage = 3300;

    /* State INIT */
    Idd_Ctx[Instance].state = IDD_INIT;

    /* Init Uart */
    if (HAL_UART_Init(&Idd_Ctx[Instance].UartHandle) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      /* work around first boot */
      SendCmdNoData((uint8_t*) "version", sizeof("version"));
      HAL_Delay(50);

      /* Check if power monitor is alive */
      if (SendCmdNoData((uint8_t*) "version", sizeof("version")) != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      /* Check if power monitor is ready */
      else if (SendCmdNoData((uint8_t*) PS1_CMD_htc, sizeof(PS1_CMD_htc)) != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      /* Configure energy mode */
      else if (SendCmdNoData((uint8_t*) PS1_CMD_output_energy, sizeof(PS1_CMD_output_energy)) != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      /* acqtime and trigdelay */
      else if (BSP_IDD_Config(Instance, &Idd_Ctx[Instance].IddConfig) != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* Initialize Powershield interrupt */
        GPIO_InitTypeDef  gpio_init_structure;

        PS1_IRQOUT_GPIO_CLK_ENABLE();

        gpio_init_structure.Pin   = PS1_IRQOUT_GPIO_PIN;
        gpio_init_structure.Pull  = GPIO_PULLDOWN;
        gpio_init_structure.Speed = GPIO_SPEED_FREQ_LOW;
        gpio_init_structure.Mode  = GPIO_MODE_IT_RISING;
        HAL_GPIO_Init(PS1_IRQOUT_GPIO_PORT, &gpio_init_structure);

        if (HAL_EXTI_GetHandle(&Idd_Ctx[Instance].hidd_exti, PS1_IRQOUT_EXTI_LINE) == HAL_OK)
        {
          /* Interrupt already enabled on BSP_PS_Init, just register callback */
          if (HAL_EXTI_RegisterCallback(&Idd_Ctx[Instance].hidd_exti, HAL_EXTI_FALLING_CB_ID, IDD1_EXTI_Callback) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
          else
          {
            /* Enable and set GPIO EXTI Interrupt */
            HAL_NVIC_SetPriority(PS1_IRQOUT_EXTI_IRQn, BSP_IDD_IT_PRIORITY, 0x00);
            HAL_NVIC_EnableIRQ(PS1_IRQOUT_EXTI_IRQn);
          }
        }
      }
    }
  }

  /* Clean context */
  if (status != BSP_ERROR_NONE)
  {
    BSP_IDD_DeInit(Instance);
  }

  return status;
}

/**
  * @brief  DeInitialize IDD measurement component
  * @param  Instance IDD instance.
  * @retval BSP status.
  */
int32_t BSP_IDD_DeInit(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else
  {
    if (HAL_UART_DeInit(&Idd_Ctx[Instance].UartHandle) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      Idd_Ctx[Instance].state = IDD_IDLE;
    }
  }

  return status;
}

/**
  * @brief  Reset Idd measurement component
  * @param  Instance IDD instance.
  * @retval BSP status
  */
int32_t BSP_IDD_Reset(uint32_t Instance)
{
  uint8_t PS1_CMD_psrst[] = PS1_CMD_psrst_string;
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else if (SendCmdNoData((uint8_t*) PS1_CMD_psrst, sizeof(PS1_CMD_psrst)) != BSP_ERROR_NONE)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    /* Nothing to do: status already BSP_ERROR_NONE */
  }

  return status;
}

/**
  * @brief  Turn Idd measurement component in low power (standby/sleep) mode
  * @param  Instance IDD instance.
  * @retval BSP status
  */
int32_t BSP_IDD_EnterLowPower(uint32_t Instance)
{
  int32_t status;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else
  {
    /* Not Supported by the Power Shield */
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  return status;
}

/**
  * @brief  Wake up Idd measurement component
  * @param  Instance IDD instance.
  * @retval BSP status
  */
int32_t BSP_IDD_ExitLowPower(uint32_t Instance)
{
  int32_t status;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else
  {
    /* Not Supported by the Power Shield */
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  return status;
}


/**
  * @brief  Start Measurement campaign
  * @param  Instance IDD instance.
  * @retval BSP status
  */
int32_t BSP_IDD_StartMeasurement(uint32_t Instance)
{
  uint8_t PS1_CMD_start[] = PS1_CMD_start_string;
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else if (SendCmdNoData((uint8_t*) PS1_CMD_start, sizeof(PS1_CMD_start)) != BSP_ERROR_NONE)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    /* Nothing to do: status already BSP_ERROR_NONE */
  }

