STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L562E-DK/stm32l562e_discovery_idd.c
  return status;
}

/**
  * @brief  Configure Idd component
  * @param  Instance IDD instance.
  * @param  IddConfig structure of idd parameters
  * @retval BSP status
  */
int32_t BSP_IDD_Config(uint32_t Instance, BSP_IDD_Config_t *IddConfig)
{
  uint8_t PS1_CMD_freq[] = PS1_CMD_freq_string;
  uint8_t PS1_CMD_acqtime[] = PS1_CMD_acqtime_string;
  uint8_t PS1_CMD_trigdelay[] = PS1_CMD_trigdelay_string;
  uint8_t PS1_CMD_voltage[] = PS1_CMD_voltage_string;
  uint8_t PS1_CMD_voltage_no_calibration[] = PS1_CMD_voltage_no_calibration_string;

  uint8_t buf[PS_CMD_LENGTH_MAX];
  uint32_t buf_length;
  int32_t status = BSP_ERROR_NONE;
  uint32_t size;
  uint32_t i;

  if ((Instance >= IDD_INSTANCES_NBR) || (IddConfig == (BSP_IDD_Config_t *)NULL))
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else
  {
    /* Set acquisition duration */
    for (i = 0; i < (sizeof(PS1_CMD_acqtime) - 1U); i++)
    {
      buf[i] = PS1_CMD_acqtime[i];
    }

    size = uintToAscii((uint32_t)IddConfig->AcquisitionDuration, buf + sizeof(PS1_CMD_acqtime) - 1U);
    buf_length = (uint32_t)(sizeof(PS1_CMD_acqtime) + size - 1U);

    buf[buf_length] = PS_SHELL_CHAR_UNIT_MILLI;
    buf_length++;

    if (SendCmdNoData((uint8_t*) buf, buf_length) != BSP_ERROR_NONE)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      for (i = 0; i < (sizeof(PS1_CMD_freq) - 1U); i++)
      {
        buf[i] = PS1_CMD_freq[i];
      }

      /* Set acquisition frequency close to acquisition time value to integrate energy on few values
         (integration dispatched on from 1 to 10 values) */
      /* Note: Raw acquisition frequency is higher than this value: in acquisition mode "energy",
         Powershield raw acquisition frequency is 100kSmps/sec and integration time
         corresponds to parameter "freq".
      */
      if(IddConfig->AcquisitionDuration >= 1000UL)
      {
        Idd_Ctx[Instance].Integration_freq = 1UL;
      }
      else if(IddConfig->AcquisitionDuration >= 100UL)
      {
        Idd_Ctx[Instance].Integration_freq = 10UL;
      }
      else if(IddConfig->AcquisitionDuration >= 10UL)
      {
        Idd_Ctx[Instance].Integration_freq = 100UL;
      }
      else
      {
        Idd_Ctx[Instance].Integration_freq = 1000UL;
      }

      size = uintToAscii(Idd_Ctx[Instance].Integration_freq, buf + sizeof(PS1_CMD_freq) - 1U);
      buf_length = sizeof(PS1_CMD_freq) + size - 1U;

      if (SendCmdNoData((uint8_t*) buf, buf_length) != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* Set trigger delay */
        for (i = 0; i < (sizeof(PS1_CMD_trigdelay) - 1U); i++)
        {
          buf[i] = PS1_CMD_trigdelay[i];
        }

        size = uintToAscii((uint32_t)IddConfig->PreDelay, buf + sizeof(PS1_CMD_trigdelay) - 1U);
        buf_length = sizeof(PS1_CMD_trigdelay) + size - 1U;

        buf[buf_length] = PS_SHELL_CHAR_UNIT_MILLI;
        buf_length++;

        if (SendCmdNoData((uint8_t*) buf, buf_length) != BSP_ERROR_NONE)
        {
          status = BSP_ERROR_PERIPH_FAILURE;
        }
        else
        {
          /* Set voltage level */
          for (i = 0; i < (sizeof(PS1_CMD_voltage) - 1U); i++)
          {
            buf[i] = PS1_CMD_voltage[i];
          }

          size = uintToAscii((uint32_t)IddConfig->Voltage, buf + sizeof(PS1_CMD_voltage) - 1U);
          buf_length = sizeof(PS1_CMD_voltage) + size - 1U;

          buf[buf_length] = PS_SHELL_CHAR_UNIT_MILLI;
          buf_length++;

          /* Add option of no calibration to not disconnect power supply */
          /* (Default case is calibration performed at each voltage change, with calibration requiring target disconnection) */
          for (i = 0; i < (sizeof(PS1_CMD_voltage_no_calibration) - 1U); i++)
          {
            buf[buf_length + i] = PS1_CMD_voltage_no_calibration[i];
          }
          buf_length += sizeof(PS1_CMD_voltage_no_calibration) - 1U;

          if (SendCmdNoData((uint8_t*) buf, buf_length) != BSP_ERROR_NONE)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }

          /* Wait for voltage stabilization */
          HAL_Delay(120);
        }
      }
    }
  }

  return status;
}

/**
  * @brief  Get Idd current value.
  * @param  Instance IDD instance.
  * @param  IddValue_nA Pointer on u32 to store Idd (unit: nA)
  * @retval BSP status
  */
int32_t BSP_IDD_GetValue(uint32_t Instance, uint32_t *IddValue_nA)
{
  uint8_t PS1_CMD_getlast[] = PS1_CMD_getlast_string;
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else
  {
    GPIO_InitTypeDef GPIO_Init;

    /* Wait for Powershield shell buffer emptying after acquisition */
    HAL_Delay(PS_SHELL_BUFFER_EMPTY_DELAY_MS);

    PS1_TX_GPIO_CLK_ENABLE();
    PS1_RX_GPIO_CLK_ENABLE();
    PS1_CLK_ENABLE();

    /* Configure COM Tx as alternate function */
    GPIO_Init.Pin       = PS1_TX_PIN;
    GPIO_Init.Mode      = GPIO_MODE_AF_OD;
    GPIO_Init.Speed     = GPIO_SPEED_FREQ_HIGH;
    GPIO_Init.Pull      = GPIO_PULLUP;
    GPIO_Init.Alternate = PS1_TX_AF;
    HAL_GPIO_Init(PS1_TX_GPIO_PORT, &GPIO_Init);

    /* Configure COM Rx as alternate function */
    GPIO_Init.Pin       = PS1_RX_PIN;
    GPIO_Init.Alternate = PS1_RX_AF;
    HAL_GPIO_Init(PS1_RX_GPIO_PORT, &GPIO_Init);

    /* COM configuration */
    Idd_Ctx[Instance].UartHandle.Instance        = PS1_INSTANCE;
    Idd_Ctx[Instance].UartHandle.Init.BaudRate   = 115200;
    Idd_Ctx[Instance].UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
    Idd_Ctx[Instance].UartHandle.Init.StopBits   = UART_STOPBITS_1;
    Idd_Ctx[Instance].UartHandle.Init.Parity     = UART_PARITY_NONE;
    Idd_Ctx[Instance].UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
    Idd_Ctx[Instance].UartHandle.Init.Mode       = UART_MODE_TX_RX;

