STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L562E-DK/stm32l562e_discovery_idd.c
    if (HAL_UART_Init(&Idd_Ctx[Instance].UartHandle) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }

    /* Get last measurement data */
    uint8_t data[PS_SHELL_FEEDBACK_LENGTH_MAX];
    uint32_t data_length;
    if (SendCmdData((uint8_t*) PS1_CMD_getlast, sizeof(PS1_CMD_getlast), data, &data_length) != BSP_ERROR_NONE)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      /* Convert energy to current */
      /* Note: Units: Energy retrieved in nJ, voltage in mV, integration frequency in Hz, current computed in nA */
      *IddValue_nA = (uint32_t)((((uint64_t)asciiToUint(data)) * Idd_Ctx[Instance].Integration_freq * 1000UL) / (Idd_Ctx[Instance].IddConfig.Voltage));
    }
  }

  return status;
}

/**
  * @brief  Enable Idd interrupt that indicates end of measurement
  * @param  Instance IDD instance.
  * @retval BSP status
  */
int32_t BSP_IDD_EnableIT(uint32_t Instance)
{
  uint8_t PS1_CMD_enableit[] = PS1_CMD_enableit_string;
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else if (SendCmdNoData((uint8_t*) PS1_CMD_enableit, sizeof(PS1_CMD_enableit)) != BSP_ERROR_NONE)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    /* Nothing to do: status already BSP_ERROR_NONE */
  }

  return status;
}

/**
  * @brief  Clear Idd interrupt that indicates end of measurement
  * @param  Instance IDD instance.
  * @retval BSP status
  */
int32_t BSP_IDD_ClearIT(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else
  {
    /* Auto Clear, nothing to do: status already BSP_ERROR_NONE */
  }

  return status;
}

/**
  * @brief  Get Idd interrupt status
  * @param  Instance IDD instance.
  * @retval status
  */
int32_t BSP_IDD_GetITStatus(uint32_t Instance)
{
  int32_t status;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else
  {
    /* Not Supported by the Power Shield */
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  return status;
}

/**
  * @brief  Disable Idd interrupt that indicates end of measurement
  * @param  Instance IDD instance.
  * @retval BSP status
  */
int32_t BSP_IDD_DisableIT(uint32_t Instance)
{
  uint8_t PS1_CMD_disableit[] = PS1_CMD_disableit_string;
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= IDD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Idd_Ctx[Instance].state == IDD_IDLE)
  {
    status = BSP_ERROR_NO_INIT;
  }
  else if (SendCmdNoData((uint8_t*) PS1_CMD_disableit, sizeof(PS1_CMD_disableit)) != BSP_ERROR_NONE)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    /* Nothing to do: status already BSP_ERROR_NONE */
  }

  return status;
}

/**
  * @}
  */

/** @defgroup STM32L562E-DK_IDD_Private_Functions STM32L562E-DK IDD Private Functions
  * @{
  */

/**
  * @brief  IDD1 EXTI line detection callbacks
  * @retval None
  */
static void IDD1_EXTI_Callback(void)
{
  BSP_IDD_Callback(0);
}

/**
  * @brief  Wait for acknowledge and retrieve feedbak data from power shield
  * @note   If command returned no data, then "returned_data_length" is equal to 0.
  * @note   To not return any data, set pointer "returned_data_length" to value NULL.
  * @param cmd Command sent to PowerShield
  * @param cmd_length Command length sent to PowerShield
  * @param returned_data Data retrieved from PowerShield. Maximum length is PS_SHELL_FEEDBACK_LENGTH_MAX.
  * @param returned_data_length Data retrieved from PowerShield
  * @retval BSP status
  */
static int32_t waitForAckData(uint8_t *cmd, uint32_t cmd_length, uint8_t *returned_data, uint32_t *returned_data_length)
{
  uint8_t PS1_shell_prompt[] = PS1_shell_prompt_string;
  uint8_t PS1_shell_acknowledge[] = PS1_shell_acknowledge_string;
  uint8_t PS1_shell_error_description[] = PS1_shell_error_description_string;

  uint32_t index, string_cmp_start_index, diff;
  HAL_StatusTypeDef halStatus;
  int32_t status = BSP_ERROR_NONE;
  static uint8_t receive_buffer[sizeof(PS1_shell_command_end_characters) + sizeof(PS1_shell_prompt) + PS_SHELL_FEEDBACK_LENGTH_MAX] = {CHAR_END_OF_STRING};

  /* Initialize variables */
  diff = 0;

  /* Receive PowerShield feedback message */
  /* Note: Receive done with maximum message length allowed, therefore
           function return state in timeout can be normal in case of
           shorter feedback message
  */
  halStatus = HAL_UART_Receive(&Idd_Ctx[0].UartHandle, (uint8_t *) receive_buffer, (uint16_t) sizeof(receive_buffer), PS_TIMEOUT);

  if(halStatus != HAL_ERROR)
  {
    /* Verify message integrity: shell command end characters */
    string_cmp_start_index = 0;
    for (index = 0; index < (sizeof(PS1_shell_command_end_characters) - 1U); index++)
    {
      if(receive_buffer[index] != PS1_shell_command_end_characters[index])
      {
        diff++;
      }
    }

    /* Verify message integrity: shell prompt */
    string_cmp_start_index += (sizeof(PS1_shell_command_end_characters) - 1U);
    for (index = 0; index < (sizeof(PS1_shell_prompt) - 1U); index++)
    {
      if(receive_buffer[string_cmp_start_index + index] != PS1_shell_prompt[index])
      {
        diff++;
      }
    }

    /* Verify message integrity: shell acknoledge string */
    /* Note: In case of error, error string (refer to "PS1_shell_error") is sent
             followed by error description */
    string_cmp_start_index += (sizeof(PS1_shell_prompt) - 1U);
    for (index = 0; index < (sizeof(PS1_shell_acknowledge) - 1U); index++)
    {
      if(receive_buffer[string_cmp_start_index + index] != PS1_shell_acknowledge[index])
      {
        diff++;
      }
    }

    /* Verify message integrity: echo of command string */
    /* Note: In case of error, error string (refer to "PS1_shell_error") is sent
             followed by error description */
    string_cmp_start_index += (sizeof(PS1_shell_acknowledge) - 1U);
    for (index = 0; index < (cmd_length - 2U); index++)
    {
      if(receive_buffer[string_cmp_start_index + index] != cmd[index])
      {
        diff++;
      }
    }

    /* Retrieve data if requested */
    if(returned_data != NULL)
    {
      /* Retrieve data if command integrity is validated */
      if (diff == 0U)
      {
        /* Set index from command end */
        string_cmp_start_index += index;

        /* Check if command returned a data */
        if(receive_buffer[string_cmp_start_index] == PS1_shell_command_end_characters[0])
        {
          /* No data to be returned */

