STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L562E-DK/stm32l562e_discovery_idd.c
          /* Add end of string character */
          returned_data[0] = CHAR_END_OF_STRING;

          /* Set string length */
          *returned_data_length = 0;
        }
        else
        {
          /* Retrieve data */
          string_cmp_start_index++;
          for (index = 0; index < (sizeof(receive_buffer) - string_cmp_start_index); index++)
          {
            if(receive_buffer[string_cmp_start_index + index] == PS1_shell_command_end_characters[0])
            {
              break;
            }
            returned_data[index] = receive_buffer[string_cmp_start_index + index];
          }

          /* Add end of string character */
          returned_data[index] = CHAR_END_OF_STRING;

          /* Set string length */
          *returned_data_length = index;
        }
      }
      else
      {
        /* Command error: return error message */
        status = BSP_ERROR_COMPONENT_FAILURE;

        /* Parse for presence of error message */
        string_cmp_start_index = 0;
        for (index = 0; index < (sizeof(receive_buffer) - sizeof(PS1_shell_error_description) - 2U); index++)
        {
          if(receive_buffer[index] == PS1_shell_error_description[0])
          {
            if(receive_buffer[index + 1U] == PS1_shell_error_description[1])
            {
              if(receive_buffer[index + sizeof(PS1_shell_error_description) - 2U] == PS1_shell_error_description[sizeof(PS1_shell_error_description) - 2U])
              {
                string_cmp_start_index = index + sizeof(PS1_shell_error_description) - 1U;
                break;
              }
            }
          }
        }

        if(string_cmp_start_index != 0U)
        {
          /* case of error message to be returned */
          /* Set index after space character */
          string_cmp_start_index++;
          /* Retrieve error message */
          for (index = 0; index < (sizeof(receive_buffer) - (string_cmp_start_index + 1U)); index++)
          {
            if(receive_buffer[string_cmp_start_index + index] == PS1_shell_command_end_characters[0])
            {
              break;
            }
            returned_data[index] = receive_buffer[string_cmp_start_index + index];
          }
          *returned_data_length = index;
        }
      }
    }
    else
    {
      /* Command integrity is not validated */
      if (diff != 0U)
      {
        /* Command error (no error message to be returned since "returned_data" is null) */
        status = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  else
  {
    status = BSP_ERROR_COMPONENT_FAILURE;
  }

  return status;
}

/**
  * @brief  Convert ASCII to Unsigned Integer
  * @param  buf Pointer to string to convert
  * @retval Unsigned integer
  */
static uint32_t asciiToUint(uint8_t * buf) {
  uint32_t c, uintNumber = 0;

  for (c = 0; buf[c] != CHAR_END_OF_STRING; c++) {
    uintNumber = (uintNumber * 10U) + buf[c] - (uint32_t)'0';
  }

  return uintNumber;
}

/**
  * @brief  Convert Unsigned Integer to ASCII
  * @param  uintNumber Unsigned integer to convert
  * @param  buf Pointer to string to convert to
  * @retval Size of ASCII string
  */
static uint32_t uintToAscii(uint32_t uintNumber, uint8_t * buf){
  uint8_t const digit[] = "0123456789";
  uint8_t* p = buf;
  uint32_t size = 0, shifter = uintNumber, number = uintNumber;

  do{
    ++p;
    shifter = shifter/10U;
    size++;
  }while(shifter != 0x0U);
  *p = CHAR_END_OF_STRING;

  do{
    p--;
    *p = digit[(uint32_t)(number%10U)];
    number = number/10U;
  }while(number != 0x0U);

  return size;
}

/**
  * @brief  Send command to the Power Shield and retrieve feedback data
  * @note   If command returned no data, then "returned_data_length" is equal to 0.
  * @param cmd Command sent to PowerShield
  * @param cmd_length Command length sent to PowerShield
  * @param returned_data Data retrieved from PowerShield. Maximum length is PS_SHELL_FEEDBACK_LENGTH_MAX.
  * @param returned_data_length Data retrieved from PowerShield
  * @retval BSP status
  */
static int32_t SendCmdData(uint8_t *cmd, uint32_t cmd_length, uint8_t *returned_data, uint32_t *returned_data_length)
{
  uint32_t index;
  uint32_t buf_length;
  uint8_t buf[PS_CMD_LENGTH_MAX] = {0};
  int32_t status = BSP_ERROR_NONE;
  uint8_t specific_command_htc = 0; /* Specific actions for command "host take control" */

  /* Detect specific commands */
  index = (sizeof(PS1_CMD_htc) - 2U);
  while(cmd[index] == PS1_CMD_htc[index])
  {
    if(index > 0U)
    {
      index --;
    }
    else
    {
      specific_command_htc = 1;
      break;
    }
  }

  /* Format buffer */
  buf_length = cmd_length;
  /* Remove end of string character */
  if(cmd[cmd_length - 1U] == 0U)
  {
    buf_length--;
  }
  for (index = 0; index < buf_length; index++)
  {
    buf[index] = cmd[index];
  }
  for (index = 0; index < (sizeof(PS1_shell_command_end_characters) - 1U); index++)
  {
    buf[buf_length + index] = PS1_shell_command_end_characters[index];
  }
  buf_length += (sizeof(PS1_shell_command_end_characters) - 1U);

  /* Transmit buffer */
  if (HAL_UART_Transmit(&Idd_Ctx[0].UartHandle, buf, (uint16_t)buf_length, PS_TIMEOUT) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  /* Check feedback message */
  else if (waitForAckData(cmd, buf_length, returned_data, returned_data_length) != BSP_ERROR_NONE)
  {
    if(specific_command_htc != 0U)
    {
      /* Case of powershield not yet ready: wait and retry */
      HAL_Delay(PS_NOT_READY_RETRY_DELAY_MS);
      if (HAL_UART_Transmit(&Idd_Ctx[0].UartHandle, buf,  (uint16_t) buf_length, PS_TIMEOUT) != HAL_OK)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      else if (waitForAckData(cmd, buf_length, returned_data, returned_data_length) != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* Nothing to do */
      }
    }
    else
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  else
  {
    /* Nothing to do: status already BSP_ERROR_NONE */
  }

  return status;
}

/**
  * @brief  Send command to the Power Shield without any feedback data to retrieve
  * @param cmd Command sent to PowerShield
  * @param cmd_length Command length sent to PowerShield
  * @retval BSP status
  */
static int32_t SendCmdNoData(uint8_t *cmd, uint32_t cmd_length)
{
  return SendCmdData(cmd, cmd_length, NULL, NULL);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

